{
  "cities": {
    "Aligarh": {
      "videos": [
        {
          "caption": "AMU students bear signs of grave injuries after police stormed their campus to disperse anti-CAA protests. The right hand of a student was amputated after being hit by a tear gas shell."
        }
      ],
      "coordinates": {
        "latitude": "27.8922",
        "longitude": "78.0618"
      }
    },
    "Ludhiana": {
      "videos": [
        {
          "caption": "Protests in Ludhiana as an early response to CAA."
        }
      ],
      "coordinates": {
        "latitude": "30.9278",
        "longitude": "75.8723"
      }
    },
    "Murshidabad": {
      "videos": [
        {
          "caption": "Six alleged BJP workers change into skullcaps and lungis, usually worn by Muslims, before being apprehended by West Bengal Police for throwing stones at a local train. "
        }
      ],
      "coordinates": {
        "latitude": "24.17",
        "longitude": "88.28"
      }
    },
    "Bhopal": {
      "videos": [
        {
          "caption": "A protest held at Iqbal Maidan against the amended Citizenship Act and the National Register of Citizens. Congress leader and former chief minister of the state Digvijaya Singh also addressed the protesters."
        }
      ],
      "coordinates": {
        "latitude": "23.25",
        "longitude": "77.41"
      }
    },
    "Srinagar": {
      "videos": [
        {
          "caption": "Two journalists are assaulted by police and have their phones snatched away while they were covering student protests"
        }
      ],
      "coordinates": {
        "latitude": "34.1",
        "longitude": "74.815"
      }
    },
    "Varanasi": {
      "videos": [
        {
          "caption": "An 8-year-old boy was killed in a stampede that occurred when anti-CAA protesters were chased away by UP Police."
        }
      ],
      "coordinates": {
        "latitude": "25.33",
        "longitude": "83"
      }
    },
    "Mangalore": {
      "videos": [
        {
          "caption": "Karnataka Police shot dead two protesters at an anti-CAA rally. In this video, one of the policemen can be heard bewilderly asking why not one of the protesters has fallen yet. "
        }
      ],
      "coordinates": {
        "latitude": "12.9",
        "longitude": "74.85"
      }
    },
    "Bulandshahr": {
      "videos": [
        {
          "caption": "Officers of UP Police pelt stones at homes and use lathis to damage cars of citizens parked on the street."
        }
      ],
      "coordinates": {
        "latitude": "28.4104",
        "longitude": "77.8484"
      }
    },
    "Coimbatore": {
      "videos": [
        {
          "caption": "Large, peaceful crowds take to the streets during an anti-CAA rally. "
        }
      ],
      "coordinates": {
        "latitude": "11",
        "longitude": "76.95"
      }
    },
    "Firozabad": {
      "videos": [
        {
          "caption": "(Image) Photos of citizens shot dead by UP police firing. Some were ordinary residents caught in the violence that erupted in the state"
        }
      ],
      "coordinates": {
        "latitude": "27.15",
        "longitude": "78.3949"
      }
    },
    "Vaniyambadi": {
      "videos": [
        {
          "caption": "Huge crowds sing the national anthem during a peaceful protest organised against CAA and NRC."
        }
      ],
      "coordinates": {
        "latitude": "12.68",
        "longitude": "78.63"
      }
    },
    "Gorakhpur": {
      "videos": [
        {
          "caption": "Police personnels violently disperse and baton charge protesters against the CAA and NRC in Gorakhpur,UP"
        }
      ],
      "coordinates": {
        "latitude": "26.7504",
        "longitude": "83.38"
      }
    },
    "AurangabadMH": {
      "videos": [
        {
          "caption": "A huge rally organised by the oppositions parties and several religious and political organisations of Indian Muslims against the Citizenship Amendment Act."
        }
      ],
      "coordinates": {
        "latitude": "19.8957",
        "longitude": "75.3203"
      }
    },
    "Tiruchirappalli": {
      "videos": [
        {
          "caption": "At the massive protest organised in the city, hundreds of Muslims including women and children, functionaries and cadres of various political parties and Tamil and Muslim outfits participated."
        }
      ],
      "coordinates": {
        "latitude": "10.81",
        "longitude": "78.69"
      }
    },
    "Jorhat": {
      "videos": [
        {
          "caption": "Students, teachers, parents/guardians and members of the Managing Committee of Doomdoom Jatiya Vidyalaya singing songs and protesting against the CAA."
        }
      ],
      "coordinates": {
        "latitude": "26.75",
        "longitude": "94.2167"
      }
    },
    "Dhule": {
      "videos": [
        {
          "caption": "About 20,000 protesters take part in the demonstration organised by the Jamiat Ulema-e-Hind Dhule against the CAA-NRC."
        }
      ],
      "coordinates": {
        "latitude": "20.9",
        "longitude": "74.77"
      }
    },
    "Kochi": {
      "videos": [
        {
          "caption": "A sea of protesters demanding the Modi government withdraw the Citizenship (Amendment) Act (CAA) gather on New Year."
        }
      ],
      "coordinates": {
        "latitude": "10.015",
        "longitude": "76.2239"
      }
    },
    "Malerkotla": {
      "videos": [
        {
          "caption": "A bandh was observed against CAA-NRC in Muslim-dominated Malerkotla town. Former JNU student leader Umar Khalid addressed the gathering as the protesters raised slogans against UP police and criticised it for “atrocities” on people there."
        }
      ],
      "coordinates": {
        "latitude": "30.53",
        "longitude": "75.88"
      }
    },
    "Raipur": {
      "videos": [
        {
          "caption": "Protesters sing songs, hold peaceful rally against the newly amended Citizenship Act."
        }
      ],
      "coordinates": {
        "latitude": "21.235",
        "longitude": "81.635"
      }
    },
    "Pune": {
      "videos": [
        {
          "caption": "Students protest against the thrashing of Jamia Millia Islamia (JMI) University students by the Delhi police and the contentious Citizenship (Amendment) Act, 2019"
        },
        {
          "caption": "Around 35,000 people took part in this peaceful rally\n"
        }
      ],
      "coordinates": {
        "latitude": "18.53",
        "longitude": "73.85"
      }
    },
    "Jaipur": {
      "videos": [
        {
          "caption": "Several organisations, including the People’s Union for Civil Liberties (PUCL), Mazdoor Kisan Shakti Sangathan (MKSS), CPI and others protested against the CAA and the NRC."
        },
        {
          "caption": "Protesters march in the Pink City to oppose Modi government's newly-passed CAA, chanting slogans calling for the saving of constitution."
        }
      ],
      "coordinates": {
        "latitude": "26.9211",
        "longitude": "75.81"
      }
    },
    "Chandigarh": {
      "videos": [
        {
          "caption": "Sudents, alumni, parents and faculty members from Punjab University take part in a peaceful protest against the CAA."
        },
        {
          "caption": "Left-aligned student unions held a statewide protest against the Citizen Amendment Act (CAA), National Register of Citizens (NRC) and National Population Register NPR) in universities and colleges across Chandigarh."
        }
      ],
      "coordinates": {
        "latitude": "30.72",
        "longitude": "76.78"
      }
    },
    "Bijnor": {
      "videos": [
        {
          "caption": "UP police arrest an elderly man with a paralysed leg, identified as Shamsuddin, during a lathi-charge raid amidst scenes of chaos punctuated by a gunshot."
        },
        {
          "caption": "A group of people, allegedly local area goons, beating up Muslim men."
        }
      ],
      "coordinates": {
        "latitude": "29.37",
        "longitude": "78.13"
      }
    },
    "Meerut": {
      "videos": [
        {
          "caption": "Meerut Police don riot gear before breaking a CCTV camera during anti-CAA protests."
        },
        {
          "caption": "UP Police threatening Muslim civilians of consequences for speaking against the government."
        }
      ],
      "coordinates": {
        "latitude": "29.0004",
        "longitude": "77.7"
      }
    },
    "Muzaffarnagar": {
      "videos": [
        {
          "caption": "Maulana Asad Raza Hussaini (66), a well-known Shia cleric, allegedly physically abused, arrested and then later on released by UP Police during mass crackdown on protests taking place in the state against the CAA and NRC. In addition, the police are accused of having \"also detained and assaulted almost all the maulana’s 100-odd students from the Saadat hostel-cum-orphanage in Muzaffarnagar town, many of them minors and most of them orphans, local people said.\"\n\n“The boys were denied access to the toilet at times, and some of them suffered rectal bleeding from the torture,” said Salman Saeed, local Congress politician and son of former MP Saiduzzaman Saeed, who lives nearby.\""
        },
        {
          "caption": "Several incidents of UP Police targetting Muslim-majority localities whose locals allege the officers vandalised and stole their personal property."
        }
      ],
      "coordinates": {
        "latitude": "29.485",
        "longitude": "77.695"
      }
    },
    "Nagpur": {
      "videos": [
        {
          "caption": "A large peaceful crowd gathers in Nagpur to protest protest against the Citizenship Amendment Act"
        },
        {
          "caption": "Thousands of protesters peacefully gather in a suburb of the city to protest against the amended Citizenship Act."
        }
      ],
      "coordinates": {
        "latitude": "21.17",
        "longitude": "79.09"
      }
    },
    "AurangabadBR": {
      "videos": [
        {
          "caption": "Aurangabad Police vandalising cars parked on the streets."
        },
        {
          "caption": "Aurangabad Police vandalising a car parked inside a house compound with lathis and a brick."
        }
      ],
      "coordinates": {
        "latitude": "24.7704",
        "longitude": "84.38"
      }
    },
    "Puducherry": {
      "videos": [
        {
          "caption": "Rabeeha Abdurehim who  had done her Masters course in Mass Communication from Pondicherry University refused to accept the gold medal during her convocation to express solidarity with students protesting against the Citizenship Amendment Act.\n"
        },
        {
          "caption": "Protest organized by Puducherry Pradesh Congress Committee against CAA. Chief minister V. Narayanasamy, along with his cabinet colleagues participated.\n"
        }
      ],
      "coordinates": {
        "latitude": "11.935",
        "longitude": "79.83"
      }
    },
    "Ahmedabad": {
      "videos": [
        {
          "caption": "Protesters chant slogans against CAA and NRC even as Ahmedabad Police detains them to Universitiy Police Station."
        },
        {
          "caption": "Police drag away protesters demonstrating against CAA and NRC."
        }
      ],
      "coordinates": {
        "latitude": "23.0301",
        "longitude": "72.58"
      }
    },
    "Chennai": {
      "videos": [
        {
          "caption": "Chennai Jamaath Federation leading a large number of protesters against CAA and NRC after Friday prayers in the city."
        },
        {
          "caption": "Chennai Police detained the protesters on charges of 'unlawful assembly', and also for not seeking prior permission for the rangoli protest."
        },
        {
          "caption": "Chennai Police arrest seven, including five women, for staging Kolam (Rangoli) that had “No to NRC, No to CAA” written alongside their designs."
        }
      ],
      "coordinates": {
        "latitude": "13.09",
        "longitude": "80.28"
      }
    },
    "Guwahati": {
      "videos": [
        {
          "caption": "Students against the Citizenship Amendment Act lathi-charged by the state police even as they try to breach security barricades to continue protesting."
        },
        {
          "caption": "Students against the newly-passed CAA write slogans on placards using own blood. "
        },
        {
          "caption": "Security personnel, including CRPF jawans with batons and shields, caught on a CCTV camera barging into the office premises of a private TV channel, Prag News, attacked its staffers during protests against the amended Citizenship Act."
        },
        {
          "caption": "Thousands of student protesters are seen sloganeering and singing in Assamese against the CAA."
        },
        {
          "caption": "IIT Guwahati students carrying out peaceful protests against CAA"
        },
        {
          "caption": "Peaceful protesters in Guwahati came together to paint messages opposing the citizenship law."
        }
      ],
      "coordinates": {
        "latitude": "26.16",
        "longitude": "91.77"
      }
    },
    "Lucknow": {
      "videos": [
        {
          "caption": "(Image) Riot police beat up protesters in an anti-CAA and NRC demonstration in the capital of Uttar Pradesh. "
        },
        {
          "caption": "Social activist and Congress worker Sadaf Jafar arrested while filming at one of the huge rallies that were organised in Lucknow"
        },
        {
          "caption": "First-person account of 'The Hindu' journalist Omar Rashid, who was detained, questioned, abused and then later released, all without a reason. The journalist alleges the police continued to ask him questions about random Kasmiris, since he also belongs to the state, but to which he had no answers. He was later released."
        },
        {
          "caption": "UP Police pelt stones at a group of people praying in a park during anti-CAA protest even as some people try to stop them."
        },
        {
          "caption": "Police throw stones, vandalise cars parked on the street of a peaceful residential colony that had no protests going on."
        },
        {
          "caption": "Opposition leader from Congress party, Priyanka Gandhi Vadra, being blocked by the UP Police while on her way to visit the family of a retired IPS officer who was arrested during the anti-CAA protests. She has also accused the police of manhandling her by grabbing her neck."
        }
      ],
      "coordinates": {
        "latitude": "26.855",
        "longitude": "80.915"
      }
    },
    "Kolkata": {
      "videos": [
        {
          "caption": "Students protesting by burning effigies of the Prime Minister and Home Minister"
        },
        {
          "caption": "Protesters march on the streets and raise slogans against police brutality during nation-wide protests over the CAA."
        },
        {
          "caption": "Anti-CAA and NRC protesters gather on the streets to peaceful stage demonstrations."
        },
        {
          "caption": "Thousands of protestors march through the city to protest against the CAA, led by members of the CPI(M) and its affiliated bodies."
        },
        {
          "caption": "Protestors raise slogans of Azadi"
        },
        {
          "caption": "Thousands of protestors marching through South Kolkata"
        },
        {
          "caption": "West Bengal chief minister Mamata Banerjee addressing protestors from a stage"
        },
        {
          "caption": "Protest rally led by Presidency University students, teachers and non-teaching staff. At least 30 other professors joined the protest"
        }
      ],
      "coordinates": {
        "latitude": "22.495",
        "longitude": "88.3247"
      }
    },
    "Hyderabad": {
      "videos": [
        {
          "caption": "Over a thousand people came out of the Mecca Masjid holding placards and shouting slogans against the union government for the new Law that they said alienates them based on their religion."
        },
        {
          "caption": "Several thousands came together at Hyderabad's Darussalam to protest against the Citizenship (Amendment) Act (CAA) and the National Register of Citizens (NRC). "
        },
        {
          "caption": "Several thousand people gathered, waving Indian flags and holding up photos of Dr BR Ambedkar and copies of the Preamble. "
        },
        {
          "caption": "Close to 300 Hyderabadi women gather at Mir Alam Eidgah in Bahadurpura to oppose the CAA."
        },
        {
          "caption": "Around 1,000 protestors raised ‘Inquilab Zindabad’, anti-Modi and Shah slogans after Friday prayers in Mecca Masjid. They were ultimately chased away by city police and RAF personnel. A few people were detained during the demonstration but were later released"
        },
        {
          "caption": "Women from NGOs and other organizations, social activists,housewives and students gathered at Eidgah Mir Alam grounds to express descent againt CAA and NRC"
        },
        {
          "caption": "Anti-CAA demonstrators organised a 'flash' protest and took oath to safeguard the Constitution at the historical Charminar. At least six students were arrested after they took part in the protest."
        },
        {
          "caption": "The ‘Million March’. Over one hundred thousand protesters, many carrying the Indian tricolour flag, took part in a peaceful march, chanting slogans against the new citizenship law"
        }
      ],
      "coordinates": {
        "latitude": "17.4",
        "longitude": "78.48"
      }
    },
    "Mumbai": {
      "videos": [
        {
          "caption": "Thousands protest against Citizenship Amendment Act and NRC.\n"
        },
        {
          "caption": "Hundreds of Mumbai college students join anti-CAA protest at Carter Road"
        },
        {
          "caption": "Hundreds of Mumbai college students join anti-CAA protest at Carter Road"
        },
        {
          "caption": "Several thousands congregate at a peacefull rally to oppose the controversial Citizen Amendment Act, passed by the government on December 9, 2019."
        },
        {
          "caption": "Many people gathered in Mumbai to make out a strong case against the Citizenship Amendment Act and the National Register of Citizens (NRC)"
        },
        {
          "caption": "Large protest against the newly-enacted Citizen Amendment Act takes place in Dharavi, Asia's largest slum. "
        },
        {
          "caption": "A protester recites a poem to a large gathering of Mumbaikars comprising students and working professionals congregated in Azad Maidan to demonstrate against the CAA-NPR-NRC. "
        },
        {
          "caption": "Mumbaikars singing protest songs on New Year's Eve."
        },
        {
          "caption": "Mumbaikars singing protest songs on New Year's Eve."
        },
        {
          "caption": "Students from universities across the country came out to protest in the night after a violent evening at one of the country's most prestigious universities, Jawaharlal Nehru University, left many students injured, some in serious conditions."
        }
      ],
      "coordinates": {
        "latitude": "19.017",
        "longitude": "72.857"
      }
    },
    "Bengaluru": {
      "videos": [
        {
          "caption": "Nine college students, protesting at Town Hall, detained by Bengaluru police"
        },
        {
          "caption": "Protest moved to Freedom Park after police detained students earlier at Townhall"
        },
        {
          "caption": "Historian Ramchandra Guha was detained by Bengaluru police while protesting against CAA"
        },
        {
          "caption": "Nearly one lakh people gathered in Quddus Saheb Eidgah as part of a peaceful protest to oppose the Citizenship Amendment Act (CAA)."
        },
        {
          "caption": "Protestors a 'Satyagrah' march towards Quddus Saheb Eidgah to protest against the CAA."
        },
        {
          "caption": "About 800 people gathered at Maurya Hotel Circle in the heart of Bengaluru for a candlelight vigil to commemorate the victims of police brutality during protests against the Citizenship Amendment Act (CAA)."
        },
        {
          "caption": "Hundreds of women turned up at the protest organised by various women's groups in the city."
        },
        {
          "caption": "Children join protests against the CAA-NRC at Faiz-E-Umar Eidgah ground."
        },
        {
          "caption": "Peaceful gathering to protest CAA."
        },
        {
          "caption": "Bengalureans gather at Cubbon Park to share food and read out the Preamble of The Constitution of India. "
        },
        {
          "caption": "Students of the Indian Institute of Management, Bengaluru reciting the preamble of the Constitution in Kannada even as peaceful protests continue across the state."
        }
      ],
      "coordinates": {
        "latitude": "12.97",
        "longitude": "77.56"
      }
    },
    "Delhi": {
      "videos": [
        {
          "caption": "Delhi Police haul up a Muslim man during an anti-CAA protest in the heart of the capital. Scenes of Muslims being selectively targetted by the police across the country increased after prime minister Narendra Modi's remarks that claimed protesters \"can be identified by the clothes they wear\"."
        },
        {
          "caption": "An unseen woman records a brutal act of police attack on ordinary citizens in a neighbourhood of Daryaganj. The woman is heard praying for the men being attacked in the visuals. "
        },
        {
          "caption": "Residents of Daryaganj run to take cover as armed policemen march through a residential colony."
        },
        {
          "caption": "Delhi Police attack protesters, some of them minor, near Jama Masjid, Old Delhi. An officer is heard saying, \"maaro, maaro\" (beat them up) even as another warns a media person to stop recording the incident."
        },
        {
          "caption": "Protesters are chased away and rounded up by Delhi Police even as a bunch of women try to stop them. "
        },
        {
          "caption": "Delhi Police swoop one of the protesters arriving at UP Bhawan, without provocation or furnishing proof of Section 144 of the CrPC that bans unlawful assembly. Many such baseless arrests have created a stand-off between the protesters and the police across the country."
        },
        {
          "caption": "Protesters at Shaheen Bagh chanting slogans of freedom. The protesters, comprising a large number of women, have faced a bitter cold season in the capital to continue protesting"
        },
        {
          "caption": "Protesters at Shaheen Bagh chanting slogans of freedom. The protesters, comprising a large number of women, have faced a bitter cold season in the capital to continue protesting"
        },
        {
          "caption": "Students and other protesters ring in the New Year at Jamia Milia University by singing the national anthem."
        },
        {
          "caption": "Jawaharlal Nehru University (JNU) Students' Union President Aishe Ghosh sobs in front of camera and in a condition where she's unable to talk as well after she was brutally attacked by a mob of masked men inside the JNU campus. "
        },
        {
          "caption": "A team of doctors, nurses and medical volunteers who reached JNU to provide first aid to injured students and teachers was attacked by goons. The ambulance was attacked and windows broken of it.  "
        },
        {
          "caption": "A large mob of masked men entered Jawaharlal Nehru University (JNU) campus with iron rods and sticks"
        },
        {
          "caption": "Atul Sood, a Jawaharlal Nehru University professor, narrates to media about the events taking place in JNU where Prof. Sood speaks regarding the entry of masked men inside the campus, security of girl students in the hostel and police action in such a situation "
        },
        {
          "caption": "Sucharita Sen, a faculty member of the Center for Study of Regional Development at Jawaharlal Nehru University, being admitted to AIIMS with a head Injury, after she was attacked by a mob of masked men"
        },
        {
          "caption": "A group of men shouting slogans calling for \"Naxalwad ki kabra khudegi, Bharat mata ki jai! (Naxalites will be buried, long live India)\" at JNU main gate"
        }
      ],
      "coordinates": {
        "latitude": "28.67",
        "longitude": "77.23"
      }
    }
  },
  "totalVideos": 106
}